#+STARTUP: overview indent
#+OPTIONS: ^:nil

** Analisando os primeiros experimentos
#+begin_src R :results output graphics file :file plot.pdf :session *R* :exports both 
library(dplyr)
library(ggplot2)

xeon_physical <- read.csv('apresentacao1/15-07_1936_tupi1.csv')
xeon_physical$CPU = 'xeon'

i9_physical <- read.csv('apresentacao1/15-07_2317_tupi4.csv')
i9_physical$CPU = 'i9'

xeon_virtual <- read.csv('apresentacao1/16-07_1234_tupi1.csv')
xeon_virtual$CPU = 'xeon'

i9_virtual <- read.csv('apresentacao1/16-07_2333_tupi4.csv')
i9_virtual$CPU='i9'

df <- bind_rows(xeon_physical, i9_physical, xeon_virtual, i9_virtual)
df |> group_by(NCPU, NGPU, N, NB, CPU) |> summarise(avg_t = mean(t)) |> print(n=100) -> df

# setting some columns as factors
#df$NB <- factor(df$NB, levels = c('128', '256', '512', '1024', '2048', '4096'))
#df$CPU <- factor(df$CPU, levels = c('xeon', 'i9'))

#***** Dentro da L1: 1024(KiB) * 256 / 4 (float size) = 65536 = 256*256
#***** Dentro da L2: 8*L1 = 262144 elementos = 512x512 
#***** Dentro da L3: 10*L2 = 2621440 elementos = 1619x1619

# plotting only physical
df |> filter(NCPU == 8 | NCPU == 24) |>
  ggplot(aes(x = NB, y = avg_t, color = CPU)) +
  geom_point() +
  geom_line() +
  labs(x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  scale_x_continuous(breaks=c(128, 256, 512, 1024, 2048, 4096)) +
  geom_vline(xintercept = 256, linetype="dotted", color = "blue", size=.3) +
  geom_vline(xintercept = 512, linetype="dotted", color = "blue", size=.3) +
  geom_vline(xintercept = 1619, linetype="dotted", color = "blue", size=.3) +

  geom_vline(xintercept = 478, linetype="dotted", color = "red", size=.3) +
  geom_vline(xintercept = 2900, linetype="dotted", color = "red", size=.3) +
  theme_classic() -> physical_plot

# plotting with all cores
df |> filter(NCPU == 16 | NCPU == 32) |>
  ggplot(aes(x = NB, y = avg_t, color = CPU)) +
  geom_point(size=2) +
  geom_line() +
  labs(x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  scale_x_continuous(breaks=c(128, 256, 512, 1024, 2048, 4096)) +
  geom_vline(xintercept = 256, linetype="dotted", color = "blue", size=.3) +
  geom_vline(xintercept = 512, linetype="dotted", color = "blue", size=.3) +
  geom_vline(xintercept = 1619, linetype="dotted", color = "blue", size=.3) +

  geom_vline(xintercept = 478, linetype="dotted", color = "red", size=.3) +
  geom_vline(xintercept = 2900, linetype="dotted", color = "red", size=.3) +
  theme_classic() -> virtual_plot

# plotting all
df |>
  mutate(Config = case_when(NCPU == 8 ~ 'Xeon físico',
                            NCPU == 16 ~ 'Xeon virtual',
                            NCPU == 24 ~ 'I9 físico',
                            NCPU == 32 ~ 'I9 virtual')) |>
  ggplot(aes(x = NB, y = avg_t, color = Config)) +
  geom_point(size=2) +
  geom_line() +
  labs(x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  scale_x_continuous(breaks=c(128, 256, 512, 1024, 2048, 4096)) +
  geom_vline(xintercept = 256, linetype="dotted", color = "blue", size=.3) +
  geom_vline(xintercept = 512, linetype="dotted", color = "blue", size=.3) +
  geom_vline(xintercept = 1619, linetype="dotted", color = "blue", size=.3) +

  geom_vline(xintercept = 478, linetype="dotted", color = "red", size=.3) +
  geom_vline(xintercept = 2900, linetype="dotted", color = "red", size=.3) +
  theme_classic() +
  theme(axis.text.x = element_text(angle = 90)) -> full_plot
#+end_src

#+RESULTS:
[[file:plot.pdf]]

#+begin_src R :results output :session *R* :exports both
ggsave('apresentacao1/physical.png', physical_plot)
ggsave('apresentacao1/virtual.png', virtual_plot)
ggsave('apresentacao1/full.png', full_plot)
#+end_src

#+RESULTS:
: [1m[22mSaving 6.67 x 6.67 in image
: [1m[22mSaving 6.67 x 6.67 in image
: [1m[22mSaving 6.67 x 6.67 in image

*** tupi4 CPU
#+begin_src bash :results silent
EXP='tupi4_cpu_only_performance_4'
echo "Id,Function,threads,gpus,P,Q,mtxfmt,nb,m,n,lda,seedA,bump,tsub,time,gflops" > experiments/${EXP}.csv && sed '/;/!d;/Id/d;s/;/,/g' experiments/${EXP}.ou >> experiments/${EXP}.csv
#+end_src
#+begin_src R :results silent :session *R* :exports both
library(dplyr)
library(ggplot2)

title <- 'tupi4_cpu_only_performance_4'
tupi3 <- read.csv(paste0('experiments/', title, '.csv'))
tupi3$node = 'tupi3'

tupi3 |>
  group_by(threads) |>
  mutate(config = case_when(
           threads == 8 ~ "8 P-Cores",
           threads == 16 ~ "8 P-Cores + HT",
           threads == 24 ~ "8 P-Cores + 16 E-Cores",
           threads == 32 ~ "8 P-Cores + HT + 16 E-Cores")) -> tupi3
tupi3$config = as.factor(tupi3$config)


# dropping worst performance
tupi3 |> group_by(nb, threads) |> arrange(time) |> slice(0:(n()-1)) |>
  print(n=100) -> tupi3_sliced

tupi3_sliced |> filter(threads == 8 | threads == 16) |>
  ggplot(aes(x = nb, y=time, color=config)) +
  geom_point(position=position_dodge2(width=100)) +
  theme_bw() +
  labs(title = title, x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  guides(color = guide_legend(title = "Configuração")) +
  scale_x_continuous(breaks=c(256, 512, 1024, 2048, 4096)) +
  expand_limits(x = 0, y = 0) -> plot_pcore

tupi3_sliced |> filter(threads == 24 | threads == 32) |>
  ggplot(aes(x = nb, y=time, color=config)) +
  geom_point(position=position_dodge2(width=100)) +
  theme_bw() +
  labs(title = title, x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  guides(color = guide_legend(title = "Configuração")) +
  scale_x_continuous(breaks=c(256, 512, 1024, 2048, 4096)) +
  expand_limits(x = 0, y = 0) -> plot_ecore

tupi3_sliced |>
  ggplot(aes(x = nb, y=time, color=config)) +
  geom_point(position=position_dodge2(width=100)) +
  theme_bw() +
  labs(title = title, x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  guides(color = guide_legend(title = "Configuração")) +
  scale_x_continuous(breaks=c(256, 512, 1024, 2048, 4096)) +
  expand_limits(x = 0, y = 0) -> plot_all

ggsave(paste0("experiments/", title, "_pcore.pdf"), plot_pcore)
ggsave(paste0("experiments/", title, "_ecore.pdf"), plot_ecore)
ggsave(paste0("experiments/", title, ".pdf"), plot_all)

#+end_src

#+RESULTS:
#+begin_example
iv      32     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  158.  [4m1[24m191. tupi3
[90m 19[39m     0 sgetrf_nopiv      32     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  158.  [4m1[24m191. tupi3
[90m 20[39m     0 sgetrf_nopiv      32     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  158.  [4m1[24m186. tupi3
[90m 21[39m     0 sgetrf_nopiv       8     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  153.  [4m1[24m226. tupi3
[90m 22[39m     0 sgetrf_nopiv       8     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  153.  [4m1[24m225. tupi3
[90m 23[39m     0 sgetrf_nopiv       8     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  153.  [4m1[24m224. tupi3
[90m 24[39m     0 sgetrf_nopiv       8     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  153.  [4m1[24m223. tupi3
[90m 25[39m     0 sgetrf_nopiv       8     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  154.  [4m1[24m222. tupi3
[90m 26[39m     0 sgetrf_nopiv      16     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m266. tupi3
[90m 27[39m     0 sgetrf_nopiv      16     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m261. tupi3
[90m 28[39m     0 sgetrf_nopiv      16     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m256. tupi3
[90m 29[39m     0 sgetrf_nopiv      16     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m254. tupi3
[90m 30[39m     0 sgetrf_nopiv      16     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m252. tupi3
[90m 31[39m     0 sgetrf_nopiv      24     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  125.  [4m1[24m503. tupi3
[90m 32[39m     0 sgetrf_nopiv      24     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  125.  [4m1[24m502. tupi3
[90m 33[39m     0 sgetrf_nopiv      24     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  126.  [4m1[24m492. tupi3
[90m 34[39m     0 sgetrf_nopiv      24     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  126.  [4m1[24m487. tupi3
[90m 35[39m     0 sgetrf_nopiv      24     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  126.  [4m1[24m487. tupi3
[90m 36[39m     0 sgetrf_nopiv      32     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m276. tupi3
[90m 37[39m     0 sgetrf_nopiv      32     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m274. tupi3
[90m 38[39m     0 sgetrf_nopiv      32     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m274. tupi3
[90m 39[39m     0 sgetrf_nopiv      32     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m274. tupi3
[90m 40[39m     0 sgetrf_nopiv      32     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m272. tupi3
[90m 41[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  152.  [4m1[24m237. tupi3
[90m 42[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  152.  [4m1[24m236. tupi3
[90m 43[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  152.  [4m1[24m236. tupi3
[90m 44[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  152.  [4m1[24m236. tupi3
[90m 45[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  152.  [4m1[24m233. tupi3
[90m 46[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m266. tupi3
[90m 47[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m266. tupi3
[90m 48[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m264. tupi3
[90m 49[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m258. tupi3
[90m 50[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m255. tupi3
[90m 51[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  126.  [4m1[24m492. tupi3
[90m 52[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  127.  [4m1[24m477. tupi3
[90m 53[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  128.  [4m1[24m469. tupi3
[90m 54[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  129.  [4m1[24m454. tupi3
[90m 55[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  129.  [4m1[24m450. tupi3
[90m 56[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m267. tupi3
[90m 57[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m267. tupi3
[90m 58[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m266. tupi3
[90m 59[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m265. tupi3
[90m 60[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m262. tupi3
[90m 61[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m271. tupi3
[90m 62[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m271. tupi3
[90m 63[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m270. tupi3
[90m 64[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m269. tupi3
[90m 65[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m266. tupi3
[90m 66[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  144.  [4m1[24m303. tupi3
[90m 67[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  146.  [4m1[24m287. tupi3
[90m 68[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  146.  [4m1[24m281. tupi3
[90m 69[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m275. tupi3
[90m 70[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m267. tupi3
[90m 71[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  123.  [4m1[24m530. tupi3
[90m 72[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  125.  [4m1[24m506. tupi3
[90m 73[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  125.  [4m1[24m500. tupi3
[90m 74[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  128.  [4m1[24m469. tupi3
[90m 75[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  128.  [4m1[24m461. tupi3
[90m 76[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  145.  [4m1[24m293. tupi3
[90m 77[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  145.  [4m1[24m293. tupi3
[90m 78[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  145.  [4m1[24m291. tupi3
[90m 79[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  145.  [4m1[24m291. tupi3
[90m 80[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  145.  [4m1[24m291. tupi3
[90m 81[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m271. tupi3
[90m 82[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m270. tupi3
[90m 83[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m267. tupi3
[90m 84[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m262. tupi3
[90m 85[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m261. tupi3
[90m 86[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  159.  [4m1[24m181. tupi3
[90m 87[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  159.  [4m1[24m181. tupi3
[90m 88[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  160.  [4m1[24m173. tupi3
[90m 89[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  161.  [4m1[24m168. tupi3
[90m 90[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  161.  [4m1[24m165. tupi3
[90m 91[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  133.  [4m1[24m411. tupi3
[90m 92[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  139.  [4m1[24m354. tupi3
[90m 93[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  139.  [4m1[24m354. tupi3
[90m 94[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  144.  [4m1[24m304. tupi3
[90m 95[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  158.  [4m1[24m188. tupi3
[90m 96[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m256. tupi3
[90m 97[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m251. tupi3
[90m 98[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m250. tupi3
[90m 99[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m249. tupi3
[90m100[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  151.  [4m1[24m243. tupi3
[90m# ℹ 1 more variable: config <fct>[39m
[1m[22mSaving 7 x 7 in image
[90m# A tibble: 100 × 18[39m
[90m# Groups:   nb, threads [20][39m
       Id Function     threads  gpus     P     Q mtxfmt    nb     m     n   lda   seedA  bump  tsub  time gflops node 
    [3m[90m<int>[39m[23m [3m[90m<chr>[39m[23m          [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m  [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m   [3m[90m<int>[39m[23m [3m[90m<dbl>[39m[23m [3m[90m<dbl>[39m[23m [3m[90m<dbl>[39m[23m  [3m[90m<dbl>[39m[23m [3m[90m<chr>[39m[23m
[90m  1[39m     0 sgetrf_nopiv       8     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  170.  [4m1[24m105. tupi3
[90m  2[39m     0 sgetrf_nopiv       8     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  170.  [4m1[24m103. tupi3
[90m  3[39m     0 sgetrf_nopiv       8     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  170.  [4m1[24m103. tupi3
[90m  4[39m     0 sgetrf_nopiv       8     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  170.  [4m1[24m102. tupi3
[90m  5[39m     0 sgetrf_nopiv       8     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  170.  [4m1[24m102. tupi3
[90m  6[39m     0 sgetrf_nopiv      16     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  155.  [4m1[24m211. tupi3
[90m  7[39m     0 sgetrf_nopiv      16     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  159.  [4m1[24m179. tupi3
[90m  8[39m     0 sgetrf_nopiv      16     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  160.  [4m1[24m176. tupi3
[90m  9[39m     0 sgetrf_nopiv      16     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  160.  [4m1[24m174. tupi3
[90m 10[39m     0 sgetrf_nopiv      16     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  161.  [4m1[24m167. tupi3
[90m 11[39m     0 sgetrf_nopiv      24     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  139.  [4m1[24m347. tupi3
[90m 12[39m     0 sgetrf_nopiv      24     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  140.  [4m1[24m344. tupi3
[90m 13[39m     0 sgetrf_nopiv      24     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  140.  [4m1[24m342. tupi3
[90m 14[39m     0 sgetrf_nopiv      24     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  141.  [4m1[24m335. tupi3
[90m 15[39m     0 sgetrf_nopiv      24     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  143.  [4m1[24m314. tupi3
[90m 16[39m     0 sgetrf_nopiv      32     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  159.  [4m1[24m177. tupi3
[90m 17[39m     0 sgetrf_nopiv      32     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  159.  [4m1[24m177. tupi3
[90m 18[39m     0 sgetrf_nopiv      32     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  160.  [4m1[24m176. tupi3
[90m 19[39m     0 sgetrf_nopiv      32     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  160.  [4m1[24m172. tupi3
[90m 20[39m     0 sgetrf_nopiv      32     0     1     1      0   256 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  160.  [4m1[24m171. tupi3
[90m 21[39m     0 sgetrf_nopiv       8     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  155.  [4m1[24m213. tupi3
[90m 22[39m     0 sgetrf_nopiv       8     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  155.  [4m1[24m212. tupi3
[90m 23[39m     0 sgetrf_nopiv       8     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  155.  [4m1[24m211. tupi3
[90m 24[39m     0 sgetrf_nopiv       8     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  155.  [4m1[24m210. tupi3
[90m 25[39m     0 sgetrf_nopiv       8     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  156.  [4m1[24m206. tupi3
[90m 26[39m     0 sgetrf_nopiv      16     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m258. tupi3
[90m 27[39m     0 sgetrf_nopiv      16     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m257. tupi3
[90m 28[39m     0 sgetrf_nopiv      16     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m254. tupi3
[90m 29[39m     0 sgetrf_nopiv      16     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m254. tupi3
[90m 30[39m     0 sgetrf_nopiv      16     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m252. tupi3
[90m 31[39m     0 sgetrf_nopiv      24     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  125.  [4m1[24m499. tupi3
[90m 32[39m     0 sgetrf_nopiv      24     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  126.  [4m1[24m488. tupi3
[90m 33[39m     0 sgetrf_nopiv      24     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  127.  [4m1[24m481. tupi3
[90m 34[39m     0 sgetrf_nopiv      24     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  127.  [4m1[24m477. tupi3
[90m 35[39m     0 sgetrf_nopiv      24     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  129.  [4m1[24m458. tupi3
[90m 36[39m     0 sgetrf_nopiv      32     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m276. tupi3
[90m 37[39m     0 sgetrf_nopiv      32     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m261. tupi3
[90m 38[39m     0 sgetrf_nopiv      32     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m257. tupi3
[90m 39[39m     0 sgetrf_nopiv      32     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m257. tupi3
[90m 40[39m     0 sgetrf_nopiv      32     0     1     1      0   512 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m250. tupi3
[90m 41[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  153.  [4m1[24m225. tupi3
[90m 42[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  153.  [4m1[24m223. tupi3
[90m 43[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  153.  [4m1[24m223. tupi3
[90m 44[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  154.  [4m1[24m219. tupi3
[90m 45[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  154.  [4m1[24m218. tupi3
[90m 46[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m255. tupi3
[90m 47[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m249. tupi3
[90m 48[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m249. tupi3
[90m 49[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  151.  [4m1[24m241. tupi3
[90m 50[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  152.  [4m1[24m238. tupi3
[90m 51[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  127.  [4m1[24m477. tupi3
[90m 52[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  127.  [4m1[24m472. tupi3
[90m 53[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  128.  [4m1[24m471. tupi3
[90m 54[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  128.  [4m1[24m470. tupi3
[90m 55[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  130.  [4m1[24m448. tupi3
[90m 56[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m254. tupi3
[90m 57[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m253. tupi3
[90m 58[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m252. tupi3
[90m 59[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m251. tupi3
[90m 60[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m1[24m024 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m250. tupi3
[90m 61[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m256. tupi3
[90m 62[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m255. tupi3
[90m 63[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m255. tupi3
[90m 64[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m255. tupi3
[90m 65[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  150.  [4m1[24m254. tupi3
[90m 66[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m280. tupi3
[90m 67[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m277. tupi3
[90m 68[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m276. tupi3
[90m 69[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m275. tupi3
[90m 70[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m270. tupi3
[90m 71[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  126.  [4m1[24m495. tupi3
[90m 72[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  126.  [4m1[24m485. tupi3
[90m 73[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  127.  [4m1[24m474. tupi3
[90m 74[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  132.  [4m1[24m418. tupi3
[90m 75[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  132.  [4m1[24m418. tupi3
[90m 76[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m278. tupi3
[90m 77[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m276. tupi3
[90m 78[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  147.  [4m1[24m273. tupi3
[90m 79[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m272. tupi3
[90m 80[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  148.  [4m1[24m269. tupi3
[90m 81[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m257. tupi3
[90m 82[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  149.  [4m1[24m256. tupi3
[90m 83[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  151.  [4m1[24m247. tupi3
[90m 84[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  151.  [4m1[24m243. tupi3
[90m 85[39m     0 sgetrf_nopiv       8     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  151.  [4m1[24m241. tupi3
[90m 86[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  153.  [4m1[24m226. tupi3
[90m 87[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  153.  [4m1[24m225. tupi3
[90m 88[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  154.  [4m1[24m219. tupi3
[90m 89[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  154.  [4m1[24m216. tupi3
[90m 90[39m     0 sgetrf_nopiv      16     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  155.  [4m1[24m209. tupi3
[90m 91[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  138.  [4m1[24m358. tupi3
[90m 92[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  141.  [4m1[24m332. tupi3
[90m 93[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  141.  [4m1[24m327. tupi3
[90m 94[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  144.  [4m1[24m302. tupi3
[90m 95[39m     0 sgetrf_nopiv      24     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  145.  [4m1[24m295. tupi3
[90m 96[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  152.  [4m1[24m233. tupi3
[90m 97[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  153.  [4m1[24m224. tupi3
[90m 98[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  154.  [4m1[24m222. tupi3
[90m 99[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  154.  [4m1[24m220. tupi3
[90m100[39m     0 sgetrf_nopiv      32     0     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  155.  [4m1[24m214. tupi3
[90m# ℹ 1 more variable: config <fct>[39m
[1m[22mSaving 7 x 7 in image
[1m[22mSaving 7 x 7 in image
[1m[22mSaving 7 x 7 in image
#+end_example

*** CPU geral
#+begin_src R :results output :session *R* :exports both
df <- bind_rows(tupi1_sliced, tupi3_sliced) 
df |>
  ggplot(aes(x = nb, y=time, color=config)) +
  geom_point(position=position_dodge2(width=100)) +
  theme_bw() +
  labs(title = 'tupi1_cpu + tupi3_cpu', x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  guides(color = guide_legend(title = "Configuração")) +
  scale_x_continuous(breaks=c(256, 512, 1024, 2048, 4096)) +
  expand_limits(x = 0, y = 0) -> plot_all

ggsave("experiments/plot_cpu_only.pdf", plot_all)

#+end_src

#+RESULTS:
: [1m[22mSaving 7 x 7 in image

*** tupi1 GPU
#+begin_src bash :results silent
EXP='tupi1_gpu_performance'
echo "Id,Function,threads,gpus,P,Q,mtxfmt,nb,m,n,lda,seedA,bump,tsub,time,gflops,cfg" > experiments/${EXP}.csv && sed '/;/!d;/Id/d;s/;/,/g' experiments/${EXP}.ou | paste -d '' - - >> experiments/${EXP}.csv
#+end_src

#+begin_src R :results output :session *R* :exports both
library(dplyr)
library(ggplot2)

title <- 'tupi1_gpu_performance'
tupi1_gpu <- read.csv(paste0('experiments/', title, '.csv'))
tupi1_gpu$node = 'tupi1'

tupi1_gpu |>
  group_by(threads) |>
  mutate(config = case_when(
           threads == 7 ~ "7 Cores + 1 CUDA",
           threads == 8 ~ "8 Cores + 0 CUDA",
           threads == 15 ~ "8 Cores + (HT -1 ) + 1 HT CUDA",
           threads == 16 ~ "8 Cores + HT + 0 CUDA")) -> tupi1_gpu
tupi1_gpu$config = as.factor(tupi1_gpu$config)

# dropping worst performance
tupi1_gpu |> group_by(nb, threads) |> arrange(time) |> slice(0:(n()-1)) |>
  print(n=100) -> tupi1_gpu_sliced

tupi1_gpu_sliced |>
  ggplot(aes(x = nb, y=time, color=config)) +
  geom_point(position=position_dodge2(width=100)) +
  theme_bw() +
  labs(title = title, x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  guides(color = guide_legend(title = "Configuração")) +
  scale_x_continuous(breaks=c(2048, 4096, 8192, 16384)) +
  expand_limits(x = 0, y = 0) -> plot

ggsave("experiments/tupi1_gpu.pdf", plot)
#+end_src

#+RESULTS:
#+begin_example
[90m# A tibble: 94 × 19[39m
[90m# Groups:   nb, threads [16][39m
      Id Function     threads  gpus     P     Q mtxfmt    nb     m     n   lda   seedA  bump  tsub   time gflops cfg  
   [3m[90m<int>[39m[23m [3m[90m<chr>[39m[23m          [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m  [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m [3m[90m<int>[39m[23m   [3m[90m<int>[39m[23m [3m[90m<dbl>[39m[23m [3m[90m<dbl>[39m[23m  [3m[90m<dbl>[39m[23m  [3m[90m<dbl>[39m[23m [3m[90m<chr>[39m[23m
[90m 1[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0   5.78 [4m3[24m[4m2[24m438. 7+1  
[90m 2[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0   5.79 [4m3[24m[4m2[24m397. 7+1  
[90m 3[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0   5.80 [4m3[24m[4m2[24m370. 7+1  
[90m 4[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0   5.80 [4m3[24m[4m2[24m365. 7+1  
[90m 5[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0   5.80 [4m3[24m[4m2[24m363. 7+1  
[90m 6[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0   5.80 [4m3[24m[4m2[24m351. 7+1  
[90m 7[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  10.9  [4m1[24m[4m7[24m283. 8    
[90m 8[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  10.9  [4m1[24m[4m7[24m280. 8    
[90m 9[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  11.0  [4m1[24m[4m7[24m083. 8    
[90m10[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  11.0  [4m1[24m[4m7[24m059. 8    
[90m11[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  11.0  [4m1[24m[4m7[24m052. 8    
[90m12[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  11.0  [4m1[24m[4m7[24m037. 8    
[90m13[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0   8.03 [4m2[24m[4m3[24m381. 15+1 
[90m14[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0   8.04 [4m2[24m[4m3[24m339. 15+1 
[90m15[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0   8.04 [4m2[24m[4m3[24m338. 15+1 
[90m16[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0   8.04 [4m2[24m[4m3[24m332. 15+1 
[90m17[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0   8.05 [4m2[24m[4m3[24m319. 15+1 
[90m18[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0   8.05 [4m2[24m[4m3[24m316  15+1 
[90m19[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  13.6  [4m1[24m[4m3[24m772. 16   
[90m20[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  13.7  [4m1[24m[4m3[24m692. 16   
[90m21[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  13.9  [4m1[24m[4m3[24m533. 16   
[90m22[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  13.9  [4m1[24m[4m3[24m521. 16   
[90m23[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  13.9  [4m1[24m[4m3[24m490. 16   
[90m24[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m2[24m048 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  13.9  [4m1[24m[4m3[24m489. 16   
[90m25[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  15.6  [4m1[24m[4m2[24m035. 7+1  
[90m26[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  15.6  [4m1[24m[4m2[24m017. 7+1  
[90m27[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  15.7  [4m1[24m[4m1[24m976. 7+1  
[90m28[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  15.7  [4m1[24m[4m1[24m967. 7+1  
[90m29[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  15.7  [4m1[24m[4m1[24m965. 7+1  
[90m30[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  15.7  [4m1[24m[4m1[24m959. 7+1  
[90m31[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  30.8   [4m6[24m084. 8    
[90m32[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  30.9   [4m6[24m074. 8    
[90m33[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  30.9   [4m6[24m072. 8    
[90m34[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  31.0   [4m6[24m060. 8    
[90m35[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  31.0   [4m6[24m050. 8    
[90m36[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  31.0   [4m6[24m047. 8    
[90m37[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  26.5   [4m7[24m071. 15+1 
[90m38[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  26.6   [4m7[24m056. 15+1 
[90m39[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  26.7   [4m7[24m036. 15+1 
[90m40[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  26.7   [4m7[24m035. 15+1 
[90m41[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  26.7   [4m7[24m032. 15+1 
[90m42[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  26.7   [4m7[24m031. 15+1 
[90m43[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  51.0   [4m3[24m676. 16   
[90m44[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  51.1   [4m3[24m673. 16   
[90m45[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  51.1   [4m3[24m673. 16   
[90m46[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  51.1   [4m3[24m670. 16   
[90m47[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  51.3   [4m3[24m660. 16   
[90m48[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m4[24m096 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  52.6   [4m3[24m570. 16   
[90m49[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  60.8   [4m3[24m088. 7+1  
[90m50[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  60.9   [4m3[24m083. 7+1  
[90m51[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  60.9   [4m3[24m083. 7+1  
[90m52[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  60.9   [4m3[24m080. 7+1  
[90m53[39m     0 sgetrf_nopiv       7     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  60.9   [4m3[24m080. 7+1  
[90m54[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  83.1   [4m2[24m259. 8    
[90m55[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  83.1   [4m2[24m259. 8    
[90m56[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  83.3   [4m2[24m252. 8    
[90m57[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  83.3   [4m2[24m252. 8    
[90m58[39m     0 sgetrf_nopiv       8     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0  83.5   [4m2[24m248. 8    
[90m59[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 107.    [4m1[24m762. 15+1 
[90m60[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 107.    [4m1[24m761. 15+1 
[90m61[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 107.    [4m1[24m761. 15+1 
[90m62[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 107.    [4m1[24m761. 15+1 
[90m63[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 107.    [4m1[24m760. 15+1 
[90m64[39m     0 sgetrf_nopiv      15     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 107.    [4m1[24m760. 15+1 
[90m65[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 184.    [4m1[24m019. 16   
[90m66[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 197.     953. 16   
[90m67[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 197.     951. 16   
[90m68[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 197.     950. 16   
[90m69[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 197.     950. 16   
[90m70[39m     0 sgetrf_nopiv      16     1     1     1      0  [4m8[24m192 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 198.     949. 16   
[90m71[39m     0 sgetrf_nopiv       7     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 257.     729. 7+1  
[90m72[39m     0 sgetrf_nopiv       7     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 257.     729. 7+1  
[90m73[39m     0 sgetrf_nopiv       7     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 258.     728. 7+1  
[90m74[39m     0 sgetrf_nopiv       7     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 258.     728. 7+1  
[90m75[39m     0 sgetrf_nopiv       7     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 258.     728. 7+1  
[90m76[39m     0 sgetrf_nopiv       7     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 258.     728. 7+1  
[90m77[39m     0 sgetrf_nopiv       8     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 385.     488. 8    
[90m78[39m     0 sgetrf_nopiv       8     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 385.     487. 8    
[90m79[39m     0 sgetrf_nopiv       8     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 385.     487. 8    
[90m80[39m     0 sgetrf_nopiv       8     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 385.     487. 8    
[90m81[39m     0 sgetrf_nopiv       8     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 386.     487. 8    
[90m82[39m     0 sgetrf_nopiv       8     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 386.     486. 8    
[90m83[39m     0 sgetrf_nopiv      15     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 434.     432. 15+1 
[90m84[39m     0 sgetrf_nopiv      15     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 434.     432. 15+1 
[90m85[39m     0 sgetrf_nopiv      15     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 436.     431. 15+1 
[90m86[39m     0 sgetrf_nopiv      15     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 436.     431. 15+1 
[90m87[39m     0 sgetrf_nopiv      15     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 436.     430. 15+1 
[90m88[39m     0 sgetrf_nopiv      15     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 436.     430. 15+1 
[90m89[39m     0 sgetrf_nopiv      16     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 758.     247. 16   
[90m90[39m     0 sgetrf_nopiv      16     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 758.     247. 16   
[90m91[39m     0 sgetrf_nopiv      16     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 759.     247. 16   
[90m92[39m     0 sgetrf_nopiv      16     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 760.     247. 16   
[90m93[39m     0 sgetrf_nopiv      16     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 762.     246. 16   
[90m94[39m     0 sgetrf_nopiv      16     1     1     1      0 [4m1[24m[4m6[24m384 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536 [4m6[24m[4m5[24m536  8.47[90me[39m8     0     0 864.     217. 16   
[90m# ℹ 2 more variables: node <chr>, config <fct>[39m
[1m[22mSaving 7 x 7 in image
#+end_example


** GPU tupi3/4
#+begin_src bash
NODE="tupi4"
JOB_NAME="gpu_performance"
VERSION=3 # remember to increment if needed
SCRIPT_NAME="scripts/${NODE}_${JOB_NAME}_${VERSION}.slurm"
TESTING_DIR="~/spack/opt/spack/linux-debian12-skylake/gcc-11.3.0/chameleon-1.2.0-vlmjaqjmrhhqbpocl7utrsvlxfbnutfm/bin"

# slurm section
echo "#!/bin/bash"                            > ${SCRIPT_NAME}
echo "#SBATCH --job-name=${JOB_NAME}"          >> ${SCRIPT_NAME}
echo "#SBATCH --partition=tupi"                >> ${SCRIPT_NAME}
echo "#SBATCH --nodelist=${NODE}"              >> ${SCRIPT_NAME}
echo "#SBATCH --time=23:30:00  "               >> ${SCRIPT_NAME}
echo "#SBATCH --output=experiments/${NODE}_${JOB_NAME}_${VERSION}.ou" >> ${SCRIPT_NAME}
echo "#SBATCH --error=experiments/${NODE}_${JOB_NAME}_${VERSION}.err" >> ${SCRIPT_NAME}

echo "export STARPU_DISPLAY_BINDINGS=1" >> ${SCRIPT_NAME}
echo "export STARPU_SCHED=dmdas" >> ${SCRIPT_NAME}

echo "rm ~/.starpu/sampling/codelets/45/*.tupi4" >> ${SCRIPT_NAME}

# 8 P-cores + 0 CUDA P-core

for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 0 2 4 6 8 10 12 14\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 8 -g 1 -n 65536 -b ${i} && echo \"8+0P\"" >> temp
    done
done

# 8 P-cores with HT + 0 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 16 -g 1 -n 65536 -b ${i} && echo \"8+HT+0P\"" >> temp
    done
done

# 8 P-cores + 16 E-cores + 0 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 0 2 4 6 8 10 12 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 24 -g 1 -n 65536 -b ${i} && echo \"8+16+0P\"" >> temp
    done
done

# 8 P-cores with HT + 16 E-cores + 0 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\" ${TESTING_DIR}/chameleon_stesting -o \
	getrf_nopiv -t 32 -g 1 -n 65536 -b ${i} && echo \"8+HT+16+0P\"" >> temp
    done
done


# 7 P-cores + 1 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 2 4 6 8 10 12 14\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 7 -g 1 -n 65536 -b ${i} && echo \"7+1P\"" >> temp
    done
done

# 7 P-cores with HT + 1 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 2 3 4 5 6 7 8 9 10 11 12 13 14 15\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 15 -g 1 -n 65536 -b ${i} && echo \"7+HT+1P\"" >> temp
    done
done

# 7 P-cores + 16 E-cores + 1 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 2 4 6 8 10 12 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 23 -g 1 -n 65536 -b ${i} && echo \"7+16+1P\"" >> temp
    done
done

# 7 P-cores with HT + 16 E-cores + 1 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\" ${TESTING_DIR}/chameleon_stesting -o \
	getrf_nopiv -t 31 -g 1 -n 65536 -b ${i} && echo \"7+HT+16+1P\"" >> temp
    done
done

cat temp | shuf >> ${SCRIPT_NAME}
rm temp

rsync --verbose --progress --recursive ${SCRIPT_NAME} lbassis@gppd-hpc.inf.ufrgs.br:~/scripts
#+end_src

#+RESULTS:
| sending                       | incremental | file  | list     |         |       |           |           |           |         |         |             |
| tupi4_gpu_performance_3.slurm |             |       |          |         |       |           |           |           |         |         |             |
|                             | 32,768      | 43%   | 0.00kB/s | 0:00:00 |     | 75,936    |      100% | 41.17MB/s | 0:00:00 | (xfr#1, | to-chk=0/1) |
|                               |             |       |          |         |       |           |           |           |         |         |             |
| sent                          | 76,062      | bytes | received |     689 | bytes | 51,167.33 | bytes/sec |           |         |         |             |
| total                         | size        | is    | 75,936   | speedup | is    | 0.99      |           |           |         |         |             |

** GPU i9
#+begin_src bash
NODE="tupi4"
JOB_NAME="gpu_performance"
VERSION=4 # remember to increment if needed
SCRIPT_NAME="scripts/${NODE}_${JOB_NAME}_${VERSION}.slurm"
TESTING_DIR="~/spack/opt/spack/linux-debian12-skylake/gcc-11.3.0/chameleon-1.2.0-vlmjaqjmrhhqbpocl7utrsvlxfbnutfm/bin"

# slurm section
echo "#!/bin/bash"                            > ${SCRIPT_NAME}
echo "#SBATCH --job-name=${JOB_NAME}"          >> ${SCRIPT_NAME}
echo "#SBATCH --partition=tupi"                >> ${SCRIPT_NAME}
echo "#SBATCH --nodelist=${NODE}"              >> ${SCRIPT_NAME}
echo "#SBATCH --time=23:30:00  "               >> ${SCRIPT_NAME}
echo "#SBATCH --output=experiments/${NODE}_${JOB_NAME}_${VERSION}.ou" >> ${SCRIPT_NAME}
echo "#SBATCH --error=experiments/${NODE}_${JOB_NAME}_${VERSION}.err" >> ${SCRIPT_NAME}

echo "export STARPU_DISPLAY_BINDINGS=1" >> ${SCRIPT_NAME}
echo "export STARPU_SCHED=dmdas" >> ${SCRIPT_NAME}

echo "rm ~/.starpu/sampling/codelets/45/*.tupi4" >> ${SCRIPT_NAME}

# 8 P-cores + 0 CUDA P-core

for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 0 2 4 6 8 10 12 14\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 8 -g 1 -n 65536 -b ${i} && echo \"8+0P\"" >> temp
    done
done

# 8 P-cores with HT + 0 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 16 -g 1 -n 65536 -b ${i} && echo \"8+HT+0P\"" >> temp
    done
done

# 8 P-cores + 16 E-cores + 0 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 0 2 4 6 8 10 12 14 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 24 -g 1 -n 65536 -b ${i} && echo \"8+16+0P\"" >> temp
    done
done

# 8 P-cores with HT + 16 E-cores + 0 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\" ${TESTING_DIR}/chameleon_stesting -o \
	getrf_nopiv -t 32 -g 1 -n 65536 -b ${i} && echo \"8+HT+16+0P\"" >> temp
    done
done


# 7 P-cores + 1 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 2 4 6 8 10 12 14\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 7 -g 1 -n 65536 -b ${i} && echo \"7+1P\"" >> temp
    done
done

# 7 P-cores with HT + 1 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 15 -g 1 -n 65536 -b ${i} && echo \"7+HT+1P\"" >> temp
    done
done

# 7 P-cores + 16 E-cores + 1 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 2 4 6 8 10 12 14 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 23 -g 1 -n 65536 -b ${i} && echo \"7+16+1P\"" >> temp
    done
done

# 7 P-cores with HT + 16 E-cores + 1 CUDA P-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\" ${TESTING_DIR}/chameleon_stesting -o \
	getrf_nopiv -t 31 -g 1 -n 65536 -b ${i} && echo \"7+HT+16+1P\"" >> temp
    done
done

cat temp | shuf >> ${SCRIPT_NAME}
rm temp

rsync --verbose --progress --recursive ${SCRIPT_NAME} lbassis@gppd-hpc.inf.ufrgs.br:~/scripts
#+end_src

#+RESULTS:
| sending                       | incremental | file  | list     |         |       |            |           |           |         |         |             |
| tupi4_gpu_performance_4.slurm |             |       |          |         |       |            |           |           |         |         |             |
|                             | 32,768      | 43%   | 0.00kB/s | 0:00:00 |     | 75,864     |      100% | 41.10MB/s | 0:00:00 | (xfr#1, | to-chk=0/1) |
|                               |             |       |          |         |       |            |           |           |         |         |             |
| sent                          | 75,989      | bytes | received |      35 | bytes | 152,048.00 | bytes/sec |           |         |         |             |
| total                         | size        | is    | 75,864   | speedup | is    | 1.0        |           |           |         |         |             |


** GPU geral
#+begin_src R :results silent :session *R* :exports both
df <- bind_rows(tupi1_gpu_sliced, tupi4_gpu_sliced)

min_t_row = df[which.min(df$time),]
min_t = min_t_row$time

threshold_t = 2.8*min_t

df |> 
  ggplot(aes(x = nb, y=time, color=config, shape=node)) +
  geom_point(position=position_dodge2(width=500), size=2) +
  theme_bw() +
  geom_hline(yintercept = threshold_t, linetype="dotted", color = "red", size=.3) +
  annotate("text", x = 12000, y = threshold_t+9, size=3, label="2.8 * min_t@i9", color="red") +
  labs(title = 'tupi1_gpu + tupi4_gpu', x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  guides(color = guide_legend(title = "Configuração"),
         shape = guide_legend(title = "Nó")) +
  scale_x_continuous(breaks=c(512, 1024, 2048, 4096, 8192, 16384)) +
  expand_limits(x = 0, y = 0) -> plot_gpu

df |> filter(nb > 512 & nb < 8192) |>
  ggplot(aes(x = nb, y=time, color=config, shape=node)) +
  geom_point(position=position_dodge2(width=500), size=2) +
  theme_bw() +
  geom_hline(yintercept = threshold_t, linetype="dotted", color = "red", size=.3) +
  annotate("text", x = 2800, y = threshold_t+.8, size=3, label="2.8 * min_t@i9", color="red") +
  labs(title = 'tupi1_gpu + tupi4_gpu', x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  guides(color = guide_legend(title = "Configuração"),
         shape = guide_legend(title = "Nó")) +
  scale_x_continuous(breaks=c(512, 1024, 2048, 4096, 8192, 16384)) +
  expand_limits(x = 0, y = 0) -> plot_gpu_zoomed

best_row_tupi1 = tupi1_gpu_sliced[which.min(tupi1_gpu_sliced$time),]
best_row_tupi4 = tupi4_gpu_sliced[which.min(tupi4_gpu_sliced$time),]

df |>
  filter((node == 'tupi1' & nb == best_row_tupi1$nb & threads == best_row_tupi1$threads) |
         (node == 'tupi4' & nb == best_row_tupi4$nb & threads == best_row_tupi4$threads)) |>
  ggplot(aes(x = nb, y=time, color=config, shape=node)) +
  geom_point(position=position_dodge2(width=500), size=2) +
  theme_bw() +
  geom_hline(yintercept = threshold_t, linetype="dotted", color = "red", size=.3) +
  annotate("text", x = 1500, y = threshold_t+0.2, size=3, label="2.8 * min_t@i9", color="red") +
  labs(title = 'tupi1_gpu + tupi4_gpu', x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  guides(color = guide_legend(title = "Configuração"),
         shape = guide_legend(title = "Nó")) +
  scale_x_continuous(breaks=c(best_row_tupi1$nb, best_row_tupi4$nb)) +
  expand_limits(x = 0, y = 0) -> plot_gpu_best

ggsave("experiments/plot_gpu_only.png", plot_gpu)
ggsave("experiments/plot_gpu_only_zoomed.png", plot_gpu_zoomed)
ggsave("experiments/plot_gpu_only_best.png", plot_gpu_best)

#+end_src
#+begin_src R :results output :session *R* :exports both
best_row_tupi1$time
best_row_tupi4$time
best_row_tupi1$time/best_row_tupi4$time
#+end_src

#+RESULTS:
: [1] 5.775007
: [1] 4.282219
: [1] 1.348602

** GPU 100k geral
#+begin_src R :results silent :session *R* :exports both
df <- bind_rows(tupi1_gpu_100k_sliced, tupi3_gpu_100k_sliced)

min_t_row = df[which.min(df$time),]
min_t = min_t_row$time

threshold_t = 2.8*min_t

df |> 
  ggplot(aes(x = nb, y=time, color=config, shape=node)) +
  geom_point(position=position_dodge2(width=500), size=2) +
  theme_bw() +
  geom_hline(yintercept = threshold_t, linetype="dotted", color = "red", size=.3) +
  annotate("text", x = 3000, y = threshold_t+7, size=3, label="2.8 * min_t@i9", color="red") +
  labs(title = 'tupi1_gpu_100k + tupi3_gpu_100k', x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  guides(color = guide_legend(title = "Configuração"),
         shape = guide_legend(title = "Nó")) +
  scale_x_continuous(breaks=c(512, 1024, 2048, 4096, 8192, 16384)) +
  expand_limits(x = 0, y = 0) -> plot_gpu

df |> filter(nb > 512 & nb < 8192) |>
  ggplot(aes(x = nb, y=time, color=config, shape=node)) +
  geom_point(position=position_dodge2(width=500), size=2) +
  theme_bw() +
  geom_hline(yintercept = threshold_t, linetype="dotted", color = "red", size=.3) +
  annotate("text", x = 3000, y = threshold_t+4, size=3, label="2.8 * min_t@i9", color="red") +
  labs(title = 'tupi1_gpu_100k + tupi3_gpu_100k', x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  guides(color = guide_legend(title = "Configuração"),
         shape = guide_legend(title = "Nó")) +
  scale_x_continuous(breaks=c(512, 1024, 2048, 4096, 8192, 16384)) +
  expand_limits(x = 0, y = 0) -> plot_gpu_zoomed

best_row_tupi1_100k = tupi1_gpu_100k_sliced[which.min(tupi1_gpu_100k_sliced$time),]
best_row_tupi3_100k = tupi3_gpu_100k_sliced[which.min(tupi3_gpu_100k_sliced$time),]

df |>
  filter((node == 'tupi1' & nb == best_row_tupi1_100k$nb & threads == best_row_tupi1_100k$threads) |
         (node == 'tupi4' & nb == best_row_tupi3_100k$nb & threads == best_row_tupi3_100k$threads)) |>
  ggplot(aes(x = nb, y=time, color=config, shape=node)) +
  geom_point(position=position_dodge2(width=500), size=2) +
  theme_bw() +
  geom_hline(yintercept = threshold_t, linetype="dotted", color = "red", size=.3) +
  annotate("text", x = 1500, y = threshold_t+1, size=3, label="2.8 * min_t@i9", color="red") +
  labs(title = 'tupi1_gpu_100k + tupi3_gpu_100k', x = "Tamanho do bloco", y = "Tempo de execução (s)") +
  guides(color = guide_legend(title = "Configuração"),
         shape = guide_legend(title = "Nó")) +
  scale_x_continuous(breaks=c(best_row_tupi1$nb, best_row_tupi4$nb)) +
  expand_limits(x = 0, y = 0) -> plot_gpu_best

ggsave("experiments/plot_gpu_only_100k.png", plot_gpu)
ggsave("experiments/plot_gpu_only_100k_zoomed.png", plot_gpu_zoomed)
ggsave("experiments/plot_gpu_only_100k_best.png", plot_gpu_best)

#+end_src
#+begin_src R :results output :session *R* :exports both
best_row_tupi1_100k$time
best_row_tupi3_100k$time
best_row_tupi1_100k$time/best_row_tupi3_100k$time
#+end_src

#+RESULTS:
: [1] 37.10758
: [1] 20.86412
: [1] 1.778536


** GPU geral
#+begin_src R :results silent :session *R* :exports both
df <- bind_rows(tupi1_gpu_sliced, tupi4_gpu_sliced)

df |>
  filter(nb < 8000) |>
  select(threads, gpus, nb, m, n, config, time, node) |>
  group_by(threads, gpus, nb, m, n, config, node) |>
  mutate(avg_time = mean(time),
         sd = sd(time)) -> gpu_df_sd

gpu_df_sd$nb = as.factor(gpu_df_sd$nb)

gpu_df_sd$config = gsub(" \\+ [0-1] CUDA","",gpu_df_sd$config)

gpu_df_sd |>
  ggplot(aes(x = nb, y=avg_time, fill=config)) +
  geom_bar(stat='identity', color='black', linewidth=0.2,  position=position_dodge()) +
  geom_errorbar(aes(ymin=avg_time-sd, ymax=avg_time+sd),
                width=.5,
                linewidth=.3,
                position=position_dodge(0.9)) +
  facet_wrap(gpu_df_sd$threads%%2,
             labeller = as_labeller(
               c("0"="Without CUDA dedicated core", "1"="With CUDA dedicated core"))) +
  scale_fill_manual(values=c('#8dd3c7','#ffffb3','#bebada','#fb8072','#80b1d3','#fdb462','#8dd3c7','#ffffb3','#bebada','#fb8072','#80b1d3','#fdb462')) +
  theme_bw(base_size=12) +
  theme(legend.key.size=unit(.75, "line"), legend.title=element_text(size=10), legend.text=element_text(size=9)) +
  labs(title = "Tupi performance", x = "Block size", y = "Execution time (s)") +
  guides(fill = guide_legend(title = "Configuration"),
         shape = guide_legend(title = "Node")) -> plot_tupi_cuda

ggsave("figures/tupi.pdf", plot_tupi_cuda)
#+end_src
#+begin_src R :results output :session *R* :exports both
best_row_tupi1$time
best_row_tupi4$time
best_row_tupi1$time/best_row_tupi4$time
#+end_src

#+RESULTS:
: [1] 5.775007
: [1] 4.282219
: [1] 1.348602

** GPU 100k
#+begin_src R :results silent :session *R* :exports both
df <- bind_rows(tupi1_gpu_100k_sliced, tupi3_gpu_100k_sliced)

df |>
  filter(nb < 8000) |>
  select(threads, gpus, nb, m, n, config, time, node) |>
  group_by(threads, gpus, nb, m, n, config, node) |>
  mutate(avg_time = mean(time),
         sd = sd(time)) -> gpu_df_100k_sd

gpu_df_100k_sd$nb = as.factor(gpu_df_100k_sd$nb)

gpu_df_100k_sd$config = gsub(" \\+ [0-1] CUDA","",gpu_df_100k_sd$config)

gpu_df_100k_sd |>
  ggplot(aes(x = nb, y=avg_time, fill=config)) +
  geom_bar(stat='identity', color='black', linewidth=0.2,  position=position_dodge()) +
  geom_errorbar(aes(ymin=avg_time-sd, ymax=avg_time+sd),
                width=.5,
                linewidth=.3,
                position=position_dodge(0.9)) +
  facet_wrap(gpu_df_100k_sd$threads%%2,
             labeller = as_labeller(
               c("0"="Without CUDA dedicated core", "1"="With CUDA dedicated core"))) +
  scale_fill_manual(values=c('#8dd3c7','#ffffb3','#bebada','#fb8072','#80b1d3','#fdb462','#8dd3c7','#ffffb3','#bebada','#fb8072','#80b1d3','#fdb462')) +
  theme_bw(base_size=12) +
  theme(legend.key.size=unit(.75, "line"), legend.title=element_text(size=10), legend.text=element_text(size=9)) +
  labs(title = "Tupi 100k performance", x = "Block size", y = "Execution time (s)") +
  guides(fill = guide_legend(title = "Configuration"),
         shape = guide_legend(title = "Node")) -> plot_tupi_cuda

ggsave("figures/tupi_100k.pdf", plot_tupi_cuda)
#+end_src
#+begin_src R :results output :session *R* :exports both
best_row_tupi1$time
best_row_tupi4$time
best_row_tupi1$time/best_row_tupi4$time
#+end_src

#+RESULTS:
: Error: object 'best_row_tupi1' not found
: Error: object 'best_row_tupi4' not found
: Error: object 'best_row_tupi1' not found

** GPU i9 CUDA E-core
#+begin_src bash
NODE="tupi4"
JOB_NAME="gpu_ecore_performance"
VERSION=1 # remember to increment if needed
SCRIPT_NAME="scripts/${NODE}_${JOB_NAME}_${VERSION}.slurm"
TESTING_DIR="~/spack/opt/spack/linux-debian12-skylake/gcc-11.3.0/chameleon-1.2.0-vlmjaqjmrhhqbpocl7utrsvlxfbnutfm/bin"

# slurm section
echo "#!/bin/bash"                            > ${SCRIPT_NAME}
echo "#SBATCH --job-name=${JOB_NAME}"          >> ${SCRIPT_NAME}
echo "#SBATCH --partition=tupi"                >> ${SCRIPT_NAME}
echo "#SBATCH --nodelist=${NODE}"              >> ${SCRIPT_NAME}
echo "#SBATCH --time=23:30:00  "               >> ${SCRIPT_NAME}
echo "#SBATCH --output=experiments/${NODE}_${JOB_NAME}_${VERSION}.ou" >> ${SCRIPT_NAME}
echo "#SBATCH --error=experiments/${NODE}_${JOB_NAME}_${VERSION}.err" >> ${SCRIPT_NAME}

echo "export STARPU_DISPLAY_BINDINGS=1" >> ${SCRIPT_NAME}
echo "export STARPU_SCHED=dmdas" >> ${SCRIPT_NAME}

echo "rm ~/.starpu/sampling/codelets/45/*.tupi4" >> ${SCRIPT_NAME}

# 8 P-cores + 1 CUDA E-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"16 0 2 4 6 8 10 12 14\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 8 -g 1 -n 65536 -b ${i}" >> temp
    done
done

# 8 P-cores with HT + 1 CUDA E-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"16 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 16 -g 1 -n 65536 -b ${i}" >> temp
    done
done

# 8 P-cores + 15 E-cores + 1 CUDA E-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"16 0 2 4 6 8 10 12 14 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\" ${TESTING_DIR}/chameleon_stesting \
	-o getrf_nopiv -t 23 -g 1 -n 65536 -b ${i}" >> temp
    done
done

# 8 P-cores with HT + 15 E-cores + 1 CUDA E-core
for i in 512 1024 2048 4096 8192 16384
do
    for j in 1 2 3 4 5 6
    do
	echo "STARPU_WORKERS_CPUID=\"16 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\" ${TESTING_DIR}/chameleon_stesting -o \
	getrf_nopiv -t 31 -g 1 -n 65536 -b ${i}" >> temp
    done
done

cat temp | shuf >> ${SCRIPT_NAME}
rm temp

rsync --verbose --progress --recursive ${SCRIPT_NAME} lbassis@gppd-hpc.inf.ufrgs.br:~/scripts
#+end_src

#+RESULTS:
| sending                             | incremental | file  | list     |         |       |           |           |          |         |         |             |
| tupi4_gpu_ecore_performance_1.slurm |             |       |          |         |       |           |           |          |         |         |             |
|                                   | 32,768      | 92%   | 0.00kB/s | 0:00:00 |     | 35,598    |      100% | 2.70MB/s | 0:00:00 | (xfr#1, | to-chk=0/1) |
|                                     |             |       |          |         |       |           |           |          |         |         |             |
| sent                                | 35,722      | bytes | received |      35 | bytes | 14,302.80 | bytes/sec |          |         |         |             |
| total                               | size        | is    | 35,598   | speedup | is    | 1.0       |           |          |         |         |             |

